/****************************************************************************/
/* NAME		: TRIF/MDIF共通標準関数定義ヘッダファイル						*/
/*																			*/
/* FUNCTION	: TRIF/MDIF共通で使用する標準関数のヘッダファイルをインクルード	*/
/*																			*/
/* ITEM No	: 																*/
/*																			*/
/* DATE		: 2006/11/21	FJT)T.Nagashima		新規作成					*/
/*												WCDMA130-0007				*/
/*																			*/
/* UPDATE 	: 																*/
/*																			*/
/*			All Rights Reserved, Copyright (C) FUJITSU LIMITED 2006			*/
/****************************************************************************/

/* 二重取込み防止 */
#ifndef	TM_CM_STD
#define	TM_CM_STD
#if 0
/****************************************************************************/
/*	標準関数のインクルード													*/
/****************************************************************************/
#include	<stdarg.h>							/*	可変個数引数			*/

/****************************************************************************/
/*	可変個数引数用型定義													*/
/****************************************************************************/
typedef	va_list	CMT_VA_LIST;					/*	可変引数配列			*/

/****************************************************************************/
/*	可変個数引数用マクロ													*/
/****************************************************************************/
#define	CMM_VA_START(list, format)	va_start(list, format)
												/*	可変引数配列使用準備	*/
#define	CMM_VA_END(list)			va_end(list)
												/*	可変引数配列解放		*/
#define	CMM_VA_ARG(list, type)		va_arg(list, type)
												/*	可変引数取得			*/
#endif
#endif
