/********************************************************************************/
/**
 *  @skip		$Id:$
 *  @file		m_cm_ReCarStaTbl.h
 *  @brief	RE carrier status report type def
 *  @date     2015/04/22 FFCS)Zhangxq create
 * 
 *  ALL Rights Reserved, Copyright (c) FUJITSU Limited 2015-
  */
/********************************************************************************/

#ifndef M_CM_RECARSTATBL_H
#define M_CM_RECARSTATBL_H

#define D_RCT_RECARLSTA_ALM_NUM  48													/* TDD is 35, 221-255, other reserve */

/******************************************************************************************************************************/
/*!
 * @REキャリア状態報告応答 各キャリア共通
 * @note  REキャリア状態報告応答 各キャリア共通
 * @{
 */
/******************************************************************************************************************************/
typedef struct{
	USHORT					car_no;													/* キャリア番号						*/
	USHORT					car_sta;												/* REキャリア状態					*/
	USHORT					car_sta_ul;												/* RE キャリア状態（UL）			*/
	USHORT					car_sta_dl;												/* RE キャリア状態(DL)				*/
	USHORT					br_num;													/* ブランチ数						*/
}__attribute__ ((packed)) RCT_CARSTS_CAR_EVERY_COM_T;
/* @} */


/******************************************************************************************************************************/
/*!
 * @REキャリア状態報告応答 キャリアの各ブランチ情報
 * @note  REキャリア状態報告応答 キャリアの各ブランチ情報
 * @{
 */
/******************************************************************************************************************************/
typedef struct{
	USHORT					br_no;													/* ブランチ番号						*/
	USHORT					br_car_sta;												/* ブランチのキャリア状態			*/
	USHORT					br_car_sta_ul;											/* ブランチのULのキャリア状態		*/
	USHORT					br_car_sta_dl;											/* ブランチのDLのキャリア状態		*/
}__attribute__ ((packed)) RCT_CARSTS_CAR_BR_EVERY_T;
/* @} */


/******************************************************************************************************************************/
/*!
 * @REキャリア状態報告応答 ALM情報数
 * @note  REキャリア状態報告応答 ALM情報数
 * @{
 */
/******************************************************************************************************************************/
typedef struct{
	USHORT					alm_num;												/* ALM情報数						*/
}__attribute__ ((packed)) RCT_CARSTS_ALM_T;
/* @} */


/******************************************************************************************************************************/
/*!
 * @REキャリア状態報告応答 ALM情報
 * @note  REキャリア状態報告応答 ALM情報
 * @{
 */
/******************************************************************************************************************************/
typedef struct{
	USHORT					rcd_almcode;											/* ALMコード						*/
}__attribute__ ((packed)) RCT_CARSTS_ALM_EVERY_T;
/* @} */


/******************************************************************************************************************************/
/*!
 * @REキャリア状態報告応答 カード
 * @note  REキャリア状態報告応答 カード
 * @{
 */
/******************************************************************************************************************************/
typedef struct{
	USHORT					card_num;												/* カード数							*/
}__attribute__ ((packed)) RCT_CARSTS_CARD_T;
/* @} */


/******************************************************************************************************************************/
/*!
 * @REキャリア状態報告応答 スロット情報
 * @note  REキャリア状態報告応答 スロット情報
 * @{
 */
/******************************************************************************************************************************/
typedef struct{
	USHORT					slot_no;												/* スロット番号						*/
}__attribute__ ((packed)) RCT_CARSTS_CARD_EVERY_T;
/* @} */


/******************************************************************************************************************************/
/*!
 * @REキャリア状態報告応答 キャリア情報
 * @note  REキャリア状態報告応答 キャリア情報
 * @{
 */
/******************************************************************************************************************************/
typedef struct{
	RCT_CARSTS_CAR_EVERY_COM_T	com;												/* キャリア							*/
	RCT_CARSTS_CAR_BR_EVERY_T	br_every[CMD_MAX_BRNUM];							/* キャリアのブランチ情報			*/
}__attribute__ ((packed)) RCT_CARSTS_CAR_EVERY_T;
/* @} */




/******************************************************************************************************************************/
/*!
 * @REキャリア状態報告管理テープル
 * @note  REキャリア状態報告管理テープル
 * @{
 */
/******************************************************************************************************************************/
typedef struct{
	CMT_CPRIF_CARLSTSRES			res;											/* 応答結果							*/
	RCT_CARSTS_CAR_EVERY_T			car_every[CMD_MAX_CARNUM_S3G];					/* キャリア情報						*/
	RCT_CARSTS_ALM_T				alm;											/* ALM								*/
	RCT_CARSTS_ALM_EVERY_T			alm_every[D_RCT_RECARLSTA_ALM_NUM];				/* ALM情報							*/
	RCT_CARSTS_CARD_T    			card;											/* カード							*/
	RCT_CARSTS_CARD_EVERY_T			card_every[CMD_OF_MAX_SLOTNUM];					/* スロット情報						*/
}__attribute__ ((packed)) RCT_CARSTS_MNG_T;

typedef struct{
	CMT_CPRIF_CARLSTSRES			res;											/* 応答結果							*/
	RCT_CARSTS_CAR_EVERY_T			car_every[CMD_MAX_CARNUM_S3G];					/* キャリア情報						*/
	RCT_CARSTS_ALM_T				alm[CMD_MAX_CARNUM_S3G];						/* ALM								*/
																					/* ALM情報							*/
	RCT_CARSTS_ALM_EVERY_T			alm_every[CMD_MAX_CARNUM_S3G][D_RCT_RECARLSTA_ALM_NUM];
	RCT_CARSTS_CARD_T    			card[CMD_MAX_CARNUM_S3G];						/* カード							*/
																					/* スロット情報						*/
	RCT_CARSTS_CARD_EVERY_T			card_every[CMD_MAX_CARNUM_S3G][CMD_OF_MAX_SLOTNUM];
}__attribute__ ((packed)) RCT_CARSTS_MNG_T2;
/* @} */

#endif
