/*!
 * @skip  $ld:$
 * @file  f_dpda_alm_stateUpdate.c
 * @brief アラーム情報更新処理
 * @date  2011/07/19 ALP)藤井 Create
 * ALL Rights Reserved, Copyright (C) FUJITSU Limited 2011-2013
 */

/*!
 * @addtogroup RRH_DPDA
 * @{
 */
#include "f_dpda_inc.h"

/*!
 * @brief 関数機能概要:アラーム情報更新処理
 * @note  関数処理内容.
 *			-# アラーム検出に必要な情報を収集する
 *			-# ハード収集情報からアラーム発生回復の判定を行う
 *			-# アラーム発生・回復変化をチェックし、アラーム通知処理を行う
 * @param  VOID
 * @param  usNumOfAlarmOccur		[out]USHORT*	アラーム発生数
 * @param  usNumOfAlarmClear		[out]USHORT*	アラーム回復数
 * @return VOID
 * @date 2011/07/19 ALPHA)藤井 Create
 * @date 2012/01/26 ALPHA)藤井 M-RRU-ZSYS-00798対処
 * @date 2013/06/03 ALPHA)中村 B25対応
 * @date 2014/02/27 ALPHA)藤井 DCM-SRE対応
 */
VOID f_dpda_alm_stateUpdate(USHORT	*usNumOfAlarmOccur,
							USHORT	*usNumOfAlarmClear)
{
	/****************************************************************************************************************/
	/*	アラーム情報収集処理																						*/
	/****************************************************************************************************************/
	f_dpda_alm_infoCollect();
	
	/****************************************************************************************************************/
	/*	アラーム検出処理																							*/
	/****************************************************************************************************************/
	f_dpda_alm_detect();
	
	/****************************************************************************************************************/
	/*	アラーム報告処理																							*/
	/****************************************************************************************************************/
	f_dpda_alm_dataMake(usNumOfAlarmOccur, usNumOfAlarmClear);

	return;
}

/* @} */
