/****************************************************************************/
/*!
 * @skip   $ld:$
 * @file   f_trp_rec_Fc02_t_it_2ndrsp_snd_3g.c
 * @brief  スレッド間(二次リセット応答)送信
 * @date   2007/03/20 FJT)Nagasima create.
 * 
 * ALL Rights Reserved, Copyright (c) FUJITSU Limited 2007
 */
/****************************************************************************/
#include "f_trp_rec.h"

/*! @addtogroup TRIF_REC
 * @{ */

/****************************************************************************/
/*!
 * @brief  スレッド間(二次リセット応答)送信
 * @note   スレッド間(二次リセット応答)を送信する
 *         - スレッド間(二次リセット応答)送信
 * @param  -
 * @return None
 * @date   2007/03/20 FJT)Nagasima create.
 */
/****************************************************************************/
VOID f_trp_rec_Fc02_t_it_2ndrsp_snd_3g(                              /* なし:R */
) {
    /* 関数トレースログ */
    F_COMF_CMM_FFUNCTRCLOG(D_TCM_TRCLOGLV_OTH, NULL, NULL);

    /************************************/
    /* スレッド間(二次リセット応答)送信 */
    /************************************/
    f_trp_rec_Fcom_t_it_2ndrsp_snd(                               /* なし:R */
        D_REC_C02_3G_CPR_NO()                                    /* CPRI番号:I */
    );

    return;
}

/* @} */  /* group TRIF_REC */

/****************************************************************************/
/*
 */
/****************************************************************************/
