/****************************************************************************/
/*!
 * @skip   $ld:$
 * @file   f_trp_rec_Fc02_m_2nd_bak_3g.c
 * @brief  二次リセット準備処理
 * @date   2008/08/20 FFCS)Shihzh create.
 * 
 * ALL Rights Reserved, Copyright (c) FUJITSU Limited 2008
 */
/****************************************************************************/
#include "f_trp_rec.h"

/*! @addtogroup TRIF_REC
 * @{ */

/****************************************************************************/
/*!
 * @brief  二次リセット準備処理
 * @note   二次リセット準備処理を行う
 *         - 自状態番号設定(二次リセット準備中)
 * @param  bufp [in]  バッファポインタ
 * @return None
 * @date   2008/08/20 FFCS)Shihzh create.
 * @date   2010/11/12 FJT)Tokunaga M-S3G-eNBSYS-xxxxx [TS-810項]
 */
/****************************************************************************/
VOID f_trp_rec_Fc02_m_2nd_bak_3g(                                    /* なし:R */
    VOID* bufp                                        /* バッファポインタ:I */
) {
    /* 関数トレースログ */
    F_COMF_CMM_FFUNCTRCLOG(D_TCM_TRCLOGLV_OTH, NULL, NULL);

    /******************/
    /* 自状態番号設定 */
    /******************/
    f_trp_rec_Fc02_t_ownstn_set_3g(                                  /* なし:R */
        EC_REC_C02_STN_2ND_RDYING                   /* 二次リセット準備中:I */
    );

    /****************************/
    /* State C 安定化タイマ停止 */
    /****************************/
    f_trp_rec_Fc02_t_timer_ccl_3g( EC_REC_TMK_2NDRST_WAT, D_REC_SLT_IV );

    return;
}

/* @} */  /* group TRIF_REC */

/****************************************************************************/
/*
 */
/****************************************************************************/
