/****************************************************************************/
/*!
 * @skip   $ld:$
 * @file   f_trp_rec_Fc02_m_ini_init_exe.c
 * @brief  初期化処理
 * @date   2007/03/20 FJT)Nagasima create.
 * 
 * ALL Rights Reserved, Copyright (c) FUJITSU Limited 2007
 */
/****************************************************************************/
#include "f_trp_rec.h"

/*! @addtogroup TRIF_REC
 * @{ */

/****************************************************************************/
/*!
 * @brief  初期化処理
 * @note   初期化処理を行う
 *         - RE状態(セクタ部)管理テーブル初期化
 *         - RE状態(共通部)管理テーブル初期化
 *         - 自Active状態設定(Negative)
 *         - 自状態番号設定(LAPBリンク確立前)
 * @param  bufp [in]  バッファポインタ
 * @return None
 * @date   2007/03/20 FJT)Nagasima create.
 * @date   2008/10/08 FFCS)Shihzh modify for S3G.
 * @date   2008/11/20 FPT)Yen update (clear status Fc03)
 */
/****************************************************************************/
VOID f_trp_rec_Fc02_m_ini_init_exe(                               /* なし:R */
    VOID* bufp                                        /* バッファポインタ:I */
) {
    /* 関数トレースログ */
    F_COMF_CMM_FFUNCTRCLOG(D_TCM_TRCLOGLV_OTH, NULL, NULL);

    /**************************************/
    /* RE状態(セクタ部)管理テーブル初期化 */
    /**************************************/
    f_trp_rec_Fc02_t_remsc_tbl_ini(                               /* なし:R */
        D_REC_INK_INI                                           /* 初期化:I */
    );

    /********************/
    /* 自Active状態設定 */
    /********************/
    f_trp_rec_Fc02_t_ownact_set(                                  /* なし:R */
        D_REC_ACK_NEGCMP                                      /* Negative:I */
    );

    /**********************************************/
    /* 残トライ回数初期化(RE強制リセット送信含む) */
    /**********************************************/
    f_trp_rec_Fc02_t_tc_all_ini(                                  /* なし:R */
    );


	/****************************************/
    /* タイマ種別→タイマ値変換テーブル生成 */
    /****************************************/
    f_trp_rec_Fcom_t_tmk_val_tbl_gen(                             /* なし:R */
    );

    /******************/
    /* 自状態番号設定 */
    /******************/
    f_trp_rec_Fc02_t_ownstn_set(                                  /* なし:R */
        EC_REC_C02_STN_RES_IDL                  /* (04)RE起動待ちアイドル:I */
    );
    
    return;
}

/* @} */  /* group TRIF_REC */

/****************************************************************************/
/*
 */
/****************************************************************************/
