/****************************************************************************/
/*!
 * @skip   $ld:$
 * @file   f_trp_rec_Fc02_t_remsc_tbl_ini_3g.c
 * @brief  RE状態(セクタ部)管理テーブル初期化
 * @date   2007/03/20 FJT)Nagasima create.
 * 
 * ALL Rights Reserved, Copyright (c) FUJITSU Limited 2007
 */
/****************************************************************************/
#include "f_trp_rec.h"

/*! @addtogroup TRIF_REC
 * @{ */

/****************************************************************************/
/*!
 * @brief  RE状態(セクタ部)管理テーブル初期化
 * @note   RE状態(セクタ部)管理テーブルを初期化する
 *         - RE状態(セクタ部)管理テーブル(Toffset値)初期化
 *         - RE状態(セクタ部)管理テーブル(RE装置構成情報)初期化
 *         - RE状態(セクタ部)管理テーブル(REスロット情報)初期化
 *         - RE状態(セクタ部)管理テーブル(REカード状態)初期化
 *         - RE状態(セクタ部)管理テーブル(REキャリア状態)初期化
 * @param  ink [in]  初期化種別
 * @return 変化
 * @retval 0:変化なし
 * @retval 1:変化あり
 * @date   2007/03/20 FJT)Nagasima create.
 * @date   2008/07/21 FFCS)Shihzh modify for S3G PRC.
 */
/****************************************************************************/
UINT f_trp_rec_Fc02_t_remsc_tbl_ini_3g(                              /* 変化:R */
    USHORT ink                                              /* 初期化種別:I */
) {
    UINT uit_ret = CMD_OFF;                                         /* 変化 */
	T_RRH_REST_3G	tReState = {};

    /* 関数トレースログ */
    F_COMF_CMM_FFUNCTRCLOG(D_TCM_TRCLOGLV_OTH, NULL, NULL);

    /*************************************************/
    /* RE状態(セクタ部)管理テーブル(Toffset値)初期化 */
    /*************************************************/
    uit_ret |= f_trp_rec_Fc02_t_tofval_ini_3g(                       /* 変化:R */
        ink                                                 /* 初期化種別:I */
    );

    /******************************************************/
    /* RE状態(セクタ部)管理テーブル(RE装置構成情報)初期化 */
    /******************************************************/
    uit_ret |= f_trp_rec_Fc02_t_reeqpinf_ini_3g(                     /* 変化:R */
        ink                                                 /* 初期化種別:I */
    );
    
    /******************************************************/
    /* RE状態(セクタ部)管理テーブル(REスロット情報)初期化 */
    /******************************************************/
    uit_ret |= f_trp_rec_Fc02_t_resltinfsc_ini_3g(                   /* 変化:R */
        ink                                                 /* 初期化種別:I */
    );

    /****************************************************/
    /* RE状態(セクタ部)管理テーブル(REカード状態)初期化 */
    /****************************************************/
    uit_ret |= f_trp_rec_Fc02_t_recrdssc_a_ini_3g(                  /* 変化:R */
        ink                                                /* 初期化種別:I */
    );

    /******************************************************/
    /* RE状態(セクタ部)管理テーブル(REキャリア状態)初期化 */
    /******************************************************/
    uit_ret |= f_trp_rec_Fc02_t_recrrsts_a_ini_3g(                  /* 変化:R */
        ink                                                /* 初期化種別:I */
    );
    
    /******************************************************/
    /* 共有メモリRE状態テーブル初期化                     */
    /******************************************************/
	tReState.signal_kind = 0;
	f_cmn_com_rest_3g_set( D_REC_C02_3G_CPR_NO(), &tReState );

	return uit_ret;
}

/* @} */  /* group TRIF_REC */

/****************************************************************************/
/*
 */
/****************************************************************************/

