/****************************************************************************/
/*!
 * @skip   $ld:$
 * @file   f_trp_rec_Fc02_m_res_reprtsts_stp.c
 * @brief  運用中RE PORT状態報告中止処理
 * @date   2008/07/21 FFCS)Shihzh create.
 * 
 * ALL Rights Reserved, Copyright (c) FUJITSU Limited 2008
 */
/****************************************************************************/
#include "f_trp_rec.h"

/*! @addtogroup TRIF_REC
 * @{ */

/****************************************************************************/
/*!
 * @brief  運用中RE PORT状態報告中止処理
 * @note   運用中RE PORT状態報告中止処理を行う
 *         - スレッド間(RE PORT状態報告プロシージャ実行指示)送信
 *         - 自状態番号設定(RE起動中(RE状態報告完了))
 * @param  bufp [in]  バッファポインタ
 * @return None
 * @date   2008/07/21 FFCS)Shihzh create.
 * @date   2016/04/25 TDI)satou 共有メモリ更新処理を追加
 */
/****************************************************************************/
VOID f_trp_rec_Fc02_m_res_reprtsts_stp(                           /* なし:R */
    VOID* bufp                                        /* バッファポインタ:I */
) {
	
    /* 関数トレースログ */
    F_COMF_CMM_FFUNCTRCLOG(D_TCM_TRCLOGLV_OTH, NULL, NULL);
	
    /**********************************************************/
    /* スレッド間(RE PORT状態報告プロシージャ実行指示)送信    */
    /**********************************************************/
    f_trp_rec_Fc02_t_it_reprtstsprc_snd(                          /* なし:R */
    );

    /******************************************************************/
    /* 共有メモリ更新. T.Oの場合、引数3と4はDon't Care */
    /******************************************************************/
    f_cmn_com_RePortSta_s3g_set(D_REC_C02_CPR_NO(), D_RRH_REPORTSTA_RSP_TO, 0, 0);

    /******************/
    /* 自状態番号設定 */
    /******************/
    f_trp_rec_Fc02_t_ownstn_set(                                  /* なし:R */
        EC_REC_C02_STN_RES_RESTSCMP           /* RE起動中(RE状態報告完了):I */
    );

    return;
}

/* @} */  /* group TRIF_REC */

/****************************************************************************/
/*
 */
/****************************************************************************/
