/****************************************************************************/
/*!
 * @skip   $ld:$
 * @file   f_trp_rec_Fc02_t_ownstn_get.c
 * @brief  自状態番号取得
 * @date   2007/03/20 FJT)Nagasima create.
 * 
 * ALL Rights Reserved, Copyright (c) FUJITSU Limited 2007
 */
/****************************************************************************/
#include "f_trp_rec.h"

/*! @addtogroup TRIF_REC
 * @{ */

/****************************************************************************/
/*!
 * @brief  自状態番号取得
 * @note   自状態番号を取得する
 * @param  -
 * @return 状態番号
 * @date   2007/03/20 FJT)Nagasima create.
 */
/****************************************************************************/
ET_REC_C02_STN f_trp_rec_Fc02_t_ownstn_get(                /* C02状態番号:R */
) {
    ET_REC_C02_STN stn;                                      /* C02状態番号 */

    /* 関数トレースログ */
    F_COMF_CMM_FFUNCTRCLOG(D_TCM_TRCLOGLV_OTH, NULL, NULL);

    /*******************/
    /* C02状態番号取得 */
    /*******************/
    stn = f_trp_rec_Fcom_t_c02stn_get(                     /* C02状態番号:R */
        D_REC_C02_CPR_NO()                                    /* CPRI番号:I */
    );

    return stn;
}

/* @} */  /* group TRIF_REC */

/****************************************************************************/
/*
 */
/****************************************************************************/
