/****************************************************************************/
/*!
 * @skip   $ld:$
 * @file   f_trp_rec_Fc03_t_tc_ini.c
 * @brief  残トライ回数初期化
 * @date   2008/07/21 FFCS)Shihzh create.
 * 
 * ALL Rights Reserved, Copyright (c) FUJITSU Limited 2008
 */
/****************************************************************************/
#include "f_trp_rec.h"

/*! @addtogroup TRIF_REC
 * @{ */

/****************************************************************************/
/*!
 * @brief  残トライ回数初期化
 * @note   残トライ回数を初期化する
 *         - TRX設定(自律)残トライ回数初期化
 *         - TRX解放(自律)残トライ回数初期化
 * @param  -
 * @return None
 * @date   2008/07/21 FFCS)Shihzh create.
 */
/****************************************************************************/
VOID f_trp_rec_Fc03_t_tc_ini(                                     /* なし:R */
) {
    /* 関数トレースログ */
    F_COMF_CMM_FFUNCTRCLOG(D_TCM_TRCLOGLV_OTH, NULL, NULL);

    /************************************/
    /* TRX設定(自律)残トライ回数初期化  */
    /************************************/
    f_trp_rec_Fc03_t_tc_txs_ini(                                  /* なし:R */
    );

    /************************************/
    /* TRX解放(自律)残トライ回数初期化  */
    /************************************/
    f_trp_rec_Fc03_t_tc_txr_ini(                                  /* なし:R */
    );

    return;
}

/* @} */  /* group TRIF_REC */

/****************************************************************************/
/*
 */
/****************************************************************************/
