/****************************************************************************/
/*!
 * @skip   $ld:$
 * @file   f_trp_rec_Fc02_m_res_refil_sta.c
 * @brief  RE起動中REファイル更新開始処理
 * @date   2007/03/20 FJT)Nagasima create.
 * 
 * ALL Rights Reserved, Copyright (c) FUJITSU Limited 2007
 */
/****************************************************************************/
#include "f_trp_rec.h"

/*! @addtogroup TRIF_REC
 * @{ */

/****************************************************************************/
/*!
 * @brief  RE起動中REファイル更新開始処理
 * @note   RE起動中REファイル更新開始処理を行う
 *         - スレッド間(REファイル更新要求)送信
 *         - 自状態番号設定(RE起動中(REファイル更新中))
 * @param  bufp [in]  バッファポインタ
 * @return None
 * @date   2007/03/20 FJT)Nagasima create.
 * @date   2015/10/08 FPT)Duong Update MKレビュー指摘No.243対応
 */
/****************************************************************************/
VOID f_trp_rec_Fc02_m_res_refil_sta_3g(                           /* なし:R */
    VOID* bufp                                        /* バッファポインタ:I */
) {
    /* 関数トレースログ */
    F_COMF_CMM_FFUNCTRCLOG(D_TCM_TRCLOGLV_OTH, NULL, NULL);

    /**************************************/
    /* スレッド間(REファイル更新要求)送信 */
    /**************************************/
    f_trp_rec_Fc02_t_it_refilreq_snd_3g(                           /* なし:R */
    );

    /******************/
    /* 自状態番号設定 */
    /******************/
    f_trp_rec_Fc02_t_ownstn_set_3g(                               /* なし:R */
        EC_REC_C02_STN_RES_REFILING         /* RE起動中(REファイル更新中):I */
    );

    return;
}

/* @} */  /* group TRIF_REC */

/****************************************************************************/
/*
 */
/****************************************************************************/
