/****************************************************************************/
/*!
 * @skip   $ld:$
 * @file   f_trp_rec_Fc02_t_l3_recrdsscreq_snd.c
 * @brief  L3(REカード状態報告要求(セクタ部部))送信
 * @date   2007/03/20 FJT)Nagasima create.
 * 
 * ALL Rights Reserved, Copyright (c) FUJITSU Limited 2007
 */
/****************************************************************************/
#include "f_trp_rec.h"

/*! @addtogroup TRIF_REC
 * @{ */

/****************************************************************************/
/*!
 * @brief  L3(REカード状態報告要求(セクタ部))送信
 * @note   L3(REカード状態報告要求(セクタ部))を送信する
 *         - L3(REカード状態報告要求)送信
 * @param  slt_no [in]  スロット番号
 * @return None
 * @date   2007/03/20 FJT)Nagasima create.
 */
/****************************************************************************/
VOID f_trp_rec_Fc02_t_l3_recrdsscreq_snd(                         /* なし:R */
    USHORT slt_no                                         /* スロット番号:I */
) {
    /* 関数トレースログ */
    F_COMF_CMM_FFUNCTRCLOG(D_TCM_TRCLOGLV_OTH, NULL, NULL);

    /********************************/
    /* L3(REカード状態報告要求)送信 */
    /********************************/
    f_trp_rec_Fcom_t_l3_recrdstsreq_snd(                    /* 終了コード:R */
        D_REC_C02_CPR_NO(),                                   /* CPRI番号:I */
        slt_no                                            /* スロット番号:I */
    );

    /**************/
    /* タイマ登録 */
    /**************/
    f_trp_rec_Fc02_t_timer_ent(                                   /* なし:R */
        EC_REC_TMK_RECRDSSC_CNF,  /* REカード状態報告(セクタ部)確認タイマ:I */
        slt_no                                            /* スロット番号:I */
    );

    return;
}

/* @} */  /* group TRIF_REC */

/****************************************************************************/
/*
 */
/****************************************************************************/
