/****************************************************************************/
/*!
 * @skip   $ld:$
 * @file   f_trp_rec_Fc02_m_2nd_exe_3g.c
 * @brief  二次リセット実行処理
 * @date   2007/03/20 FJT)Nagasima create.
 * 
 * ALL Rights Reserved, Copyright (c) FUJITSU Limited 2007
 */
/****************************************************************************/
#include "f_trp_rec.h"

/****************************************************************************/
/*!
 * @brief  二次リセット実行処理
 * @note   二次リセット実行処理を行う
 *         - HW(RE強制リセット)送信
 *         - スレッド間(二次リセット応答)送信
 *         - 自状態番号設定(RE強制リセット中)
 * @param  bufp [in]  バッファポインタ
 * @return None
 * @date   2007/03/20 FJT)Nagasima create.
 */
/****************************************************************************/
VOID f_trp_rec_Fc02_m_2nd_exe_3g(                                    /* なし:R */
    VOID* bufp                                        /* バッファポインタ:I */
) {
    /* 関数トレースログ */
    F_COMF_CMM_FFUNCTRCLOG(D_TCM_TRCLOGLV_OTH, NULL, NULL);

    /**************************/
    /* HW(RE強制リセット)送信 */
    /**************************/
    f_trp_rec_Fc02_t_hw_refrcrst_snd(                             /* なし:R */
    );

    /********************************************/
    /* 残トライ回数(RE強制リセット)デクリメント */
    /********************************************/
    f_trp_rec_Fc02_t_tc_refrcrst_dec_3g(                             /* なし:R */
    );

    /************************************/
    /* スレッド間(二次リセット応答)送信 */
    /************************************/
    f_trp_rec_Fc02_t_it_2ndrsp_snd(                               /* なし:R */
    );

    /******************/
    /* 自状態番号設定 */
    /******************/
    f_trp_rec_Fc02_t_ownstn_set_3g(                               /* なし:R */
        EC_REC_C02_STN_REFRCRSTING                    /* RE強制リセット中:I */
    );

    return;
}
/****************************************************************************/
/*
 */
/****************************************************************************/
